fix: doc lints and updates
